Revit 2027 API
FilledRegionType.IsValidFillPatternId Method
 Check if the id is a FillPatternElement or an invalidElementId
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsValidFillPatternId(
	ElementId patternId
)
Public Function IsValidFillPatternId (
	patternId As ElementId
) As Boolean
public:
bool IsValidFillPatternId(
	ElementId^ patternId
)
member IsValidFillPatternId :
        patternId : ElementId -> bool
Parameters
patternId ElementId
 Element id of the FillPatternElement
Return Value
Boolean
 True if the id is InvalidElementId, or if the element is a FillPatternElement. False otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
FilledRegionType Class
Autodesk.Revit.DB Namespace